// ==============================
// 1. 系統初始化
// ==============================
ADI $r0, $r0, 0      
ADI $r1, $r0, 0      
ADI $r2, $r0, 100    

// 【 把 Task B 的初始存檔放在 80 (遠離程式碼) 】
ADI $r3, $r0, 80    // Base address = 80
SWD $r2, $r3, 0      // Mem[80] = 100

// ==============================
// Task A
// ==============================
TASK_A:
    ADI $r1, $r1, 1      
    ADI $r3, $r0, 3
    BEQ $r1, $r3, SWITCH_A_TO_B
    JMP TASK_A           

// ==============================
// Context Switch: A -> B
// ==============================
SWITCH_A_TO_B:
    // 【把 A 存到 100】
    ADI $r3, $r0, 100
    SWD $r1, $r3, 0      // Mem[100] = R1

    // 【從 80 讀取 B】
    ADI $r3, $r0, 80
    LWD $r1, $r3, 0      // R1 = Mem[80]
    JMP TASK_B

// ==============================
// Task B
// ==============================
TASK_B:
    ADI $r1, $r1, 1      
    ADI $r3, $r0, 105
    BEQ $r1, $r3, SWITCH_B_TO_A
    JMP TASK_B

// ==============================
// Context Switch: B -> A
// ==============================
SWITCH_B_TO_A:
    // 【把 B 存到 80 】
    ADI $r3, $r0, 80
    SWD $r1, $r3, 0      

    // 【從 100 讀取 A】
    ADI $r3, $r0, 100
    LWD $r1, $r3, 0      
    JMP TASK_A